---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyInt64
source: html/ace85dc8-1c0e-7f2f-6a91-2ef4f3fcfb66.htm
---
# AssetPropertyInt64 Methods

Adds a new connected asset attached to this asset property, if it allows it.